// 普通运算符与其他编程语言大致相同
// 位运算符 &
// 按位 "与" 处理两个长度相同的二进制数,同一为一,否则为0
var x = 5 & 1; // 0101 & 0001 ==> 0001 = 1
console.log(x);
// 按位 "或" 处理两个长度相同的二进制数,有一个为 1 则为 1
var x2 = 5 | 1; // 0101 | 0001 ==> 0101 = 5
console.log(x2);
// 取反 "~" 对一个二进制位 取反
var x3 = ~5; // 0101 ==> 1010 = -6
console.log(x3);
// 异或 "^" 相同为 0 不同为 1
var x4 = 5 ^ 1; // 0101 ^ 0001 ==> 0100 = 4
console.log(x4);
// 左移 "<<" 二进制位左移n位
var x5 = 5 << 1; // 0101 ==> 01010 = 10
console.log(x5);
// 右移 ">>" 与左移相反
var x6 = 5 >> 1; // 0101 ==> 0010 = 2
console.log(x6);
// 无符号右移 ">>>" 与有符号右移类似,除了左边一律使用0补位
var x7 = 2 >>> 1; // 0010 >>> 1 ==> 0001 = 1
console.log(x7);
// 类型运算符
var num = 12;
console.log(typeof num); //输出结果: number
